app/Http/Controllers/RestorantController.php

select * from `localmenus` where `localmenus`.`restaurant_id` = 17 and `localmenus`.`restaurant_id` is not null
---
    public function edit(Restorant $restaurant)
    {
        //Days of the week
        $timestamp = strtotime('next Monday');
        for ($i = 0; $i < 7; $i++) {
            $days[] = strftime('%A', $timestamp);
            $timestamp = strtotime('+1 day', $timestamp);
        }

        //Generate days columns
        $hoursRange = [];
        for ($i = 0; $i < 7; $i++) {
            $from = $i.'_from';
            $to = $i.'_to';

            array_push($hoursRange, $from);
            array_push($hoursRange, $to);
        }

        $hours = Hours::where(['restorant_id' => $restaurant->id])->get($hoursRange)->first();

        //Languages
        $available_languages=$restaurant->localMenus()->get()->pluck('languageName','id');
        $default_language=null;
        foreach ($restaurant->localMenus()->get() as $key => $localMenu) {

select * from `restorants` where `active` = 1
---
    public function restaurantslocations()
    {
        //TODO - Method for admin onlt
        if (! auth()->user()->hasRole('admin')) {
            dd('Not allowed');
        }

        $toRespond = [
            'restaurants'=> Restorant::where('active', 1)->get(),
        ];